#language: ru

Функционал: Яндекс-Маркет

  Сценарий: Наушники Beats

    Когда выбран пункт меню - "Маркет"
    Тогда закртытие вкладки Яндекс и переход во вкладку Маркет

    Когда выбор пункта меню  - "Электроника"
    Тогда переход в раздел Наушники и Bluetooth-гарнитуры

    Тогда нажатие на кнопку Все фильтры

    Тогда поле "Цена" заполняется значением -  "5000"
    И активация чекбокса Beats
    И нажатие на кнопку Показать

    Тогда вывдено результатов поисковой выдачи на странице:  "19"
    Тогда получаем первое значение из списка

    Тогда полее "Поиск"  заполняется значением
    Тогда получаем первое значение из выдачи
    Тогда первое поле выдачи "Первый элемент поиска" заполнено значением -  "<string>"


